IDEA StatiCa Open Model
RebarGeneral.PlaneNormal Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Normal vector of the plane where the rebar lie. Used to deterine if this rebar is stirrup.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Vector3D PlaneNormal { get; set; }
Public Property PlaneNormal As Vector3D
	Get
	Set
public:
property Vector3D^ PlaneNormal {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
RebarGeneral Class
IdeaRS.OpenModel.Model Namespace